import glob

#----------------------------------------------
# SHT30  : 온도/습도 센서 I2C 설정
# BME280 : 온도/습도/기압 센서 I2C 설정
# 연결된 센서 리스트 : sudo i2cdetect -y 1
# 0x44 : 실내
# 0x77 : 실외
#----------------------------------------------
I2C_SHT30_ADDRESS  = 0x44
I2C_BME280_ADDRESS = 0x76

#----------------------------------------------------------------------------------------------------------------
# MH-Z19B : CO2 센서 설정
# "/dev/ttyAMA0" or "/dev/serial0"  - ls -l /dev | grep serial 로 포터 확인 후 선택
#----------------------------------------------------------------------------------------------------------------
SERIAL_PORT = "/dev/ttyAMA0" 
BAUD_RATE = 9600

#----------------------------------------------------------------------------------
# DS18B20 수온 센서 1-Wire 설정
#----------------------------------------------------------------------------------
BASE_PATH = '/sys/bus/w1/devices/'
DEVICE_FOLDERS = glob.glob(BASE_PATH + '28*')  # 연결된 모든 DS18B20 센서 가져오기
DEVICE_FILES = [device_folder + '/w1_slave' for device_folder in DEVICE_FOLDERS]
